---
title: ExportPatternTable
classe: Autodesk.Revit.DB.ExportPatternTable
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# ExportPatternTable

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Count { get; }` | `exportPatternTable.Count` | Int32 |
| `Boolean IsValidObject { get; }` | `exportPatternTable.IsValidObject` | Boolean |
| `ExportPatternInfo Item { get; set; }` | `exportPatternTable.Item` | ExportPatternInfo |
| `Void Add(ExportPatternKey, ExportPatternInfo)` | `exportPatternTable.Add(exportPatternKey, exportPatternInfo)` | Void |
| `Void Clear()` | `exportPatternTable.Clear()` | Void |
| `Boolean ContainsKey(ExportPatternKey)` | `exportPatternTable.ContainsKey(exportpatternKey)` | Boolean |
| `Void Dispose()` | `exportPatternTable.Dispose()` | Void |
| `IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>> GetEnumerator()` | `exportPatternTable.GetEnumerator()` | IEnumerator<KeyValuePair<ExportPatternKey, ExportPatternInfo>> |
| `ExportPatternInfo GetExportPatternInfo(ExportPatternKey)` | `exportPatternTable.GetExportPatternInfo(exportPatternKey)` | ExportPatternInfo |
| `IList<ExportPatternKey> GetKeys()` | `exportPatternTable.GetKeys()` | IList<ExportPatternKey> |
| `ExportPatternTableIterator GetPatternTableIterator()` | `exportPatternTable.GetPatternTableIterator()` | ExportPatternTableIterator |
| `IList<ExportPatternInfo> GetValues()` | `exportPatternTable.GetValues()` | IList<ExportPatternInfo> |
| `Void Remove(ExportPatternKey)` | `exportPatternTable.Remove(exportPatternKey)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```